cmsis-svd/cmsis-svd/data/Nuvoton/NUC029AN_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P1_IEN</name>
          <displayName>P1_IEN</displayName>
          <description>P1 Interrupt Enable</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P1_ISRC</name>
          <displayName>P1_ISRC</displayName>
          <description>P1 Interrupt Source Flag</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P2_PMD</name>
          <displayName>P2_PMD</displayName>
          <description>P2 Pin I/O Mode Control</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P2_OFFD</name>
          <displayName>P2_OFFD</displayName>
          <description>P2 Digital Input Path Disable Control</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P2_DOUT</name>
          <displayName>P2_DOUT</displayName>
          <description>P2 Data Output Value</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P2_DMASK</name>
          <displayName>P2_DMASK</displayName>
          <description>P2 Data Output Write Mask</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P2_PIN</name>
          <displayName>P2_PIN</displayName>
          <description>P2 Pin Value</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P2_DBEN</name>
          <displayName>P2_DBEN</displayName>
          <description>P2 De-bounce Enable</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P2_IMD</name>
          <displayName>P2_IMD</displayName>
          <description>P2 Interrupt Mode Control</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P2_IEN</name>
          <displayName>P2_IEN</displayName>
          <description>P2 Interrupt Enable</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P2_ISRC</name>
          <displayName>P2_ISRC</displayName>
          <description>P2 Interrupt Source Flag</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P3_PMD</name>
          <displayName>P3_PMD</displayName>
          <description>P3 Pin I/O Mode Control</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P3_OFFD</name>
          <displayName>P3_OFFD</displayName>
          <description>P3 Digital Input Path Disable Control</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P3_DOUT</name>
          <displayName>P3_DOUT</displayName>
          <description>P3 Data Output Value</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P3_DMASK</name>
          <displayName>P3_DMASK</displayName>
          <description>P3 Data Output Write Mask</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P3_PIN</name>
          <displayName>P3_PIN</displayName>
          <description>P3 Pin Value</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P3_DBEN</name>
          <displayName>P3_DBEN</displayName>
          <description>P3 De-bounce Enable</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P3_IMD</name>
          <displayName>P3_IMD</displayName>
          <description>P3 Interrupt Mode Control</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P3_IEN</name>
          <displayName>P3_IEN</displayName>
          <description>P3 Interrupt Enable</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P3_ISRC</name>
          <displayName>P3_ISRC</displayName>
          <description>P3 Interrupt Source Flag</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P4_PMD</name>
          <displayName>P4_PMD</displayName>
          <description>P4 Pin I/O Mode Control</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P4_OFFD</name>
          <displayName>P4_OFFD</displayName>
          <description>P4 Digital Input Path Disable Control</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P4_DOUT</name>
          <displayName>P4_DOUT</displayName>
          <description>P4 Data Output Value</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P4_DMASK</name>
          <displayName>P4_DMASK</displayName>
          <description>P4 Data Output Write Mask</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P4_PIN</name>
          <displayName>P4_PIN</displayName>
          <description>P4 Pin Value</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P4_DBEN</name>
          <displayName>P4_DBEN</displayName>
          <description>P4 De-bounce Enable</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P4_IMD</name>
          <displayName>P4_IMD</displayName>
          <description>P4 Interrupt Mode Control</description>
          <addressOffset>0x118</addressOffset>
       </register>
